Тест1/src/Documents/Статистика/Статистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Статистика</name>
  <attributes>
    <name>ИтогоСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>ВидРасхода</name>
      <type>
        <types>CatalogRef.ВидыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/Статистика/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПриИзменении(Элемент)
	Если Объект.Зарплата Тогда
		Элементы.Работник.Видимость = ИСТИНА;
		Элементы.Год.Видимость = ИСТИНА;
		Элементы.Месяц.Видимость = ИСТИНА;
	Иначе
		Элементы.Работник.Видимость = ЛОЖЬ;
		Элементы.Год.Видимость = ЛОЖЬ;
		Элементы.Месяц.Видимость = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Если Объект.Зарплата Тогда
		Элементы.Работник.Видимость = ИСТИНА;
		Элементы.Год.Видимость = ИСТИНА;
		Элементы.Месяц.Видимость = ИСТИНА;
	Иначе
		Элементы.Работник.Видимость = ЛОЖЬ;
		Элементы.Год.Видимость = ЛОЖЬ;
		Элементы.Месяц.Видимость = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры
